Revit 2027 API
DetailCurveArray.Insert Method
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual void Insert(
	DetailCurve item,
	int index
)
Public Overridable Sub Insert (
	item As DetailCurve,
	index As Integer
)
public:
virtual void Insert(
	DetailCurve^ item,
	int index
)
abstract Insert :
        item : DetailCurve *
        index : int -> unit
override Insert :
        item : DetailCurve *
        index : int -> unit
Parameters
item DetailCurve
index Int32
See Also
Reference
DetailCurveArray Class
Autodesk.Revit.DB Namespace